public class Task7 {
    public static void main(String[] arg) {

        /**
         * Дано: Стороны квадрата a = 50, b = 20. Найти площадь.
         * Вывести на консоль
         */
        int a = 50;
        int b = 20;
        int square = a * b;

        System.out.println(square);

    }
}
